Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_Framework_SwiftUI/project_save.tmx
Source language: en_us
Languages: ja

source: In a group of sibling views, raising a view’s layout priority encourages that view to shrink later when the group is shrunk and stretch sooner when the group is stretched.
ja: 氏族ビューのグループにおいて、あるビューのもつレイアウト優先度を上げることは、そのビューにグループが後で縮小される時に縮小するそしてグループが広げられる時にすぐに伸長するように勧めます。

source: In a sandboxed application, child processes created with the Process class inherit the sandbox of the parent app.
ja: サンドボックス化されたアプリケーションでは、Processクラスで作成される子プロセスは、親アプリのサンドボックスを継承します。

source: In addition, a document-node object (specifically, an instance of XMLDocument) represents an XML document in its entirety.
ja: さらに、書類ノードオブジェクト（具体的には、XMLDocumentのインスタンス）は、そっくりそのままXML書類を表します。

source: In fact, s.flatMap(transform) is equivalent to Array(s.map(transform).joined()).
ja: 実際、s.flatMap(transform)はArray(s.map(transform).joined())に等しいです。

source: In iOS and watchOS, the user triggers a standard button by tapping on it.
ja: iOSとwatchOSでは、ユーザは標準ボタンを、それをタップする（軽くたたく）ことによって作動させます。

source: In macOS, the user triggers a standard button by clicking on it.
ja: macOSでは、ユーザは標準ボタンを、それをクリックすることによって作動させます。

source: In most cases, you need only invoke the superclass implementation, adding any subclass-specific code before or after the invocation, as necessary.
ja: ほとんどの場合には、あなたはスーパークラス実装の発動だけが必要です、何らかのサブクラス特有コードをその発動の前または後に加えます、必要に応じて。

source: In particular, the names "Bethany" and "Eric" are removed from employees.
ja: 個別的には、"Bethany"と"Eric"がemployeesから除去されます。

source: In some cases, oldMember may be distinguishable from newMember by identity comparison or some other means.
ja: いくつかの場合には、oldMemberは同一性比較または何らかの他の意味でnewMemberから区別可能であるかもしれません。

source: In storyboards, specify the name of your view controller in the Identifier property of the Attributes inspector.
ja: ストーリーボードにおいて、あなたのビューコントローラの名前をAttributesインスペクタのIdentifierプロパティにおいて指定してください。

source: In that case you may need to apply edgesIgnoringSafeArea(_:) to the container instead.
ja: その場合にはあなたは代わりにedgesIgnoringSafeArea(_:)をそのコンテナへと適用する必要があるかもしれません。

source: In that case, the method returns nil.
ja: その場合には、このメソッドはnilを返します。

source: In the Landmarks app, a user can flag their favorite places, and filter the list to show just their favorites.
ja: Landmarksアプリにおいて、ユーザは彼らのお気に入りの場所にフラグで印して、そのリストをフィルタにかけて彼らのお気に入りだけを示せます。

source: In the Landmarks app, users can create a profile to express their personality.
ja: Landmarksアプリにおいて、ユーザはプロファイルを作成して彼らの個性を表現します。

source: In the data model, an XMLDTD object is conceptually similar to namespace and attribute nodes: it is not considered to be a child of the XMLDocument object although it is closely associated with it.
ja: データモデルにおいて、XMLDTDオブジェクトは概念的に名前空間と属性ノードに似ています：それはXMLDocumentオブジェクトの子であると見なされません、とはいえそれはそれと密接に結びつけられます。

source: In the example below a ContextMenu that contains four menu items is created and is passed into the contextMenu(_:) modifier.
ja: 下の例において４つのメニュー項目を含むContextMenuは、作成されて、そしてcontextMenu(_:)修飾子へと渡されます。

source: In the example below configures a TextField with the .default keyboard.
ja: 下の例ではあるTextFieldを.defaultキーボードで構成設定します。

source: In the example below the compositingGroup() modifier separates the application of effects into stages.
ja: 下の例においてcompositingGroup()修飾子は、エフェクトそれらの適用をいくつかの舞台に隔てます。

source: In the example below, navigationBarTitle(_:, displayMode) uses a string to provide a title for the navigation bar.
ja: 下の例において、navigationBarTitle(_:, displayMode)は、ある文字列を使ってタイトルをナビゲーションバーに提供します。

source: In the example below, all of the Touch Bar items are visible in the Touch Bar by default, except for the “Clubs” item.
ja: 以下の例において、Touch Bar項目の全ては、Touch Barにおいて初期状態で可視です、“Clubs” 項目を除いては。

source: In the example below, four buttons are added to a Touch Bar content struct and then added to the Touch Bar:
ja: 下の例において、４つのボタンはTouch Bar内容structへと加えられます、そしてそれからTouch Barに加えられます：

source: In the example below, text for the navigation bar title is provided using a string.
ja: 下の例において、ナビゲーションバータイトルに対するテキストは、ある文字列を使って提供されます。

source: In the example below, the HStack is offset by a constant of 50 points to the right of center:
ja: 下の例において、HStackは50ポイントの定数によって中心の右へとオフセットされます：

source: In the example below, the contrast(_:) modifier is applied to a set of red squares each containing a contrasting green inner circle.
ja: 下の例において、contrast(_:)修飾子は、一揃いの赤い正方形に適用されます、それぞれは違いの際立つ緑の内部の円を含んでいます。

source: In the example below, the bounds of text view constrains the amount of text that the view displays and the truncationMode(_:) specifies from which direction and where to display the truncation indicator:
ja: 下の例において、テキストビューの境界はビューが表示するテキストの量を制約します、そしてtruncationMode(_:)は切り詰め指示子を表示するのはどの方向からそしてどこにかを指定します：

source: In the example below, the contents of the Text view are center aligned.
ja: 下の例において、Textビューの内容は中央揃えにされます。

source: In the example below, the outer VStack contains two child views, the first is a VStack containing a default accented button.
ja: 下の例において、外側のVStackは２つの子ビューを含みます、最初のものは VStackで省略時の強調されたボタンを含んでいます。

source: In the example below, the text is rotated 45˚ about the y axis, front-most (the default zIndex) and default perspective (1):
ja: 下の例において、テキストはy軸、最前面（初期状態のzIndex）そして初期状態のperspective（1）で45˚回転されます：

source: In the following example, a disclosure group contains two toggles and an embedded disclosure group.
ja: 以下の例において、ある開示グループは２つのトグルそしてある埋め込み開示グループを持ちます。

source: In the following example, the .priority shipping option is removed from the options option set.
ja: 以下の例において、.priority出荷オプションは、optionsオプションセットから除去されます。

source: In the following example, the .secondDay shipping option is added to the freeOptions option set if purchasePrice is greater than 50.0.
ja: 次の例において、.secondDay出荷オプションは、purchasePriceが50.0より大きいならば、freeOptionsオプションセットを加えられます。

source: In the following example, the employees set is disjoint with the visitors set because no name appears in both sets.
ja: 次の例において、employees集合はvisitors集合と交わりを持ちません、両方に現れる名前がないからです。

source: In the following example, the nonNeighbors set is made up of the elements of the employees set that are not elements of neighbors:
ja: 次の例において、nonNeighbors集合はemployees集合の要素でneighborsの要素でないものから作り上げられます：

source: In the following example, the button isn’t interactive because the outer disabled(_:) modifier overrides the inner one:
ja: 以下の例において、ボタンは相互作用しません、なぜなら外側のdisabled(_:)修飾子は内側のものをオーバーライドします：

source: In the following example, the elements of the employees set that are also members of the neighbors set are removed.
ja: 次の例において、employees集合の要素でまたneighbors集合のメンバでもあるものは除去されます。

source: In the following example, the predicate provides an ordering for an array of a custom HTTPResponse type.
ja: 以下の例では、その述部はあつらえのHTTPResponse型の配列に対してある順序付けを提供します。

source: In the following example, there are three important states: no interaction (inactive), long press in progress (pressing), and dragging (dragging).
ja: 以下の例において、３つの重要な状態があります：相互作用なし（inactive）、進行中の長押し（pressing）、そしてドラッグ（dragging）。

source: In the next example, the .express element is passed to remove(_:).
ja: 次の例では、.express要素がremove(_:)に渡されます。

source: In the storyboard of your watch app, specify the name of your custom class for your dynamic interactive interface.
ja: あなたのwatchアプリのストーリーボードにおいて、あなたのあつらえのクラスの名前をあなたの動的相互作用インターフェイスに指定してください。

source: In the update callback, the new value uses an enumeration to represent the combination of the possible gesture states.
ja: 更新コールバックにおいて、新しいvalueは列挙を使って可能なジェスチャ状態の組み合わせを表します。

source: In this example, filter(_:) is used to include only names shorter than five characters.
ja: この例において、filter(_:)は５つの文字より短い名前のみ含めるために使われます。

source: In this example, map is used first to convert the names in the array to lowercase strings and then to count their characters.
ja: この例では、mapは最初に配列中の名前を小文字文字列に変換するために、それからそれらの文字を数えるために使われます。

source: In this example, an array of three ranges is flattened so that the elements of each range can be iterated in turn.
ja: この例において、３つの範囲からなる配列は平坦化されます、それで各範囲の要素は順に反復されることができます。

source: In this example, note the difference in the result of using map and compactMap with a transformation that returns an optional Int value.
ja: この例において、mapとcompactMapを、オプショナルInt値を返す変換とともに使う結果の違いに注意してください。

source: In this example, note the difference in the result of using map and flatMap with a transformation that returns an array.
ja: この例では、mapとflatMapを配列を返すある変換と共に使う結果における差異を注記します。

source: In this example, the four-point border covers the text:
ja: この例では、4ポイントの境界線がテキストを覆います：

source: In this example, the purple ellipse has a 3:4 width to height ratio, and scales to fill its frame:
ja: この例において、紫の楕円は3:4の幅と高さの比率を持ちます、そしてそれの枠をいっぱいに満たすように縮尺されます：

source: In this example, the purple ellipse has a 3:4 width to height ratio, and scales to fit its frame:
ja: この例において、紫の楕円は3:4の幅と高さの比率を持ちます、そしてそれの枠に収まるよう縮尺されます：

source: In tvOS, the user triggers a standard button by pressing “select” on an external remote, like the Siri Remote, while focusing on the button.
ja: tvOSでは、ユーザは標準ボタンを、そのボタンにフォーカスして（焦点を合わせて）いる間に “select” をSiri Remoteのような外部リモコン上で押すことによって作動させます。

source: In your implementation, create a custom Swift instance that can communicate with other parts of your interface.
ja: あなたの実装において、あるあつらえのSwiftインスタンスを作成してください、それはあなたのインターフェイスの他の部分と通信できるものです。

source: Includes name information for custom actions
ja: あつらえのアクションに対する名前情報を含みます

source: Includes the following by default on macOS:
ja: 初期状態ではmacOS上で以下を含みます：

source: Incorporate the received data into your app’s data model as appropriate.
ja: 受け取ったデータをあなたのアプリのもつデータモデルへと適切に組み入れます。

source: Index
ja: インデックス

source: Indicate how to style the text, controls, and other content contained in a view.
ja: どのようにビューの中に含まれるテキスト、コントロール、および他の内容をスタイル指定するかを指し示します。

source: Indicates an error in XML parsing.
ja: XML構文解析におけるあるエラーを指し示します。

source: Indicates that an object has been inserted into the to-many relationship that is being observed.
ja: 監視されている対多関係へとあるオブジェクトが挿入されたことを指し示します。

source: Indicates that an object has been removed from the to-many relationship that is being observed.
ja: 監視されている対多関係からオブジェクトが取り除かれたことを指し示します。

source: Indicates that an object has been replaced in the to-many relationship that is being observed.
ja: 監視されている対多関係においてオブジェクトが置き換えられたことを指し示します。

source: Indicates that the value of the observed key path was set to a new value.
ja: 監視されたキーパスの値が、新しい値に設定されたことを指し示します。

source: Indicates whether a view is being edited.
ja: ビューが編集されているかどうかを指し示します。

source: Indicates whether at least one item conforms to at least one of the specified uniform type identifiers.
ja: 少なくとも１つの項目が少なくとも１つの指定のユニーム型識別子に準拠するかどうかを指し示します。

source: Indicates whether two text views are equal.
ja: ２つのテキストビューが等しいかどうかを指し示します。

source: Indicates whether two text views are not equal.
ja: ２つのテキストビューが等しくないかどうかを指し示します。

source: Indicates whether two truncation modes are equal.
ja: ２つの切り詰めモードが等しいかどうかを指し示します。

source: Indicates whether two truncation modes are not equal.
ja: ２つの切り詰めモードが等しくないかどうかを指し示します。

source: Indicates whether two values are not equal.
ja: ２つの値が等しくないかどうかを指し示します。

source: Indicates whether two values aren’t equal.
ja: ２つの値が等しくないかどうかを指し示します。

source: Indicating Collapsibility
ja: 折りたたみ可能性を指し示す

source: Inequality is the inverse of equality.
ja: 不等性は、同等性の裏返しです。

source: Infrequently Used Views
ja: まれに使われるビュー

source: Inherit the display mode from the previous navigation item.
ja: 表示モードを前のナビゲーション項目から継承します。

source: Inherited By
ja: 継承される先

source: Inheriting from it are the classes XMLElement, XMLDocument, XMLDTD, and XMLDTDNode.
ja: それから継承しているのは、クラスXMLElement、XMLDocument、XMLDTD、そしてXMLDTDNodeです。

source: Inherits From
ja: 継承元

source: Initializers
ja: イニシャライザ

source: Initializes a parser with the XML content referenced by the given URL.
ja: あるパーサーを初期化します、与えられたURLによって参照されるXML内容を使います。

source: Initializes a parser with the XML contents encapsulated in a given data object.
ja: あるパーサーを初期化します、与えられたデータオブジェクトの中にカプセル化されるXML内容を使います。

source: Initializes a parser with the XML contents from the specified stream and parses it..
ja: あるパーサーを初期化します、指定されたストリームからそしてそれを構文解析するXML内容を使います。

source: Initializes and returns a newly allocated AppKit view with a specified frame rectangle.
ja: 新しくアロケートされたAppKitビューをある指定されたフレーム矩形で初期化して返します。

source: Initializes and returns an NSXMLDTD object created from the DTD declarations encapsulated in an NSData object
ja: NSXMLDTDオブジェクトを初期化して返します、NSDataオブジェクトの中にカプセル化されたDTD宣言から作成されます。

source: Initializes and returns an NSXMLDTD object created from the DTD declarations in a URL-referenced source.
ja: NSXMLDTDオブジェクトを初期化して返します、あるURL参照されたソースの中のDTD宣言から作成されます。

source: Initializes and returns an NSXMLDocument object created from a string containing XML markup text.
ja: あるNSXMLDocumentオブジェクトを初期化して返します、XMLマークアップテキストを含んでいる文字列から作成されます。

source: Initializes and returns an NSXMLDocument object created from an NSData object.
ja: あるNSXMLDocumentオブジェクトを初期化して返します、NSDataオブジェクトから作成されます。

source: Initializes and returns an NSXMLDocument object created from the XML or HTML contents of a URL-referenced source
ja: あるNSXMLDocumentオブジェクトを初期化して返します、URL参照されたソースのXMLまたはHTML内容から作成されます。

source: Initializing Font with platform font instance (CTFont) can bridge SwiftUI Font with NSFont or UIFont, both of which are toll-free bridged to CTFont.
ja: Fontをプラットホームフォントインスタンス（CTFont）で初期化することは、SwiftUI FontにNSFontまたはUIFontでブリッジ可能です、それらの両方ともCTFontにトールフリーブリッジされます。

source: Initializing NSXMLDocument Objects
ja: NSXMLDocumentオブジェクトを初期化する

source: Initializing NSXMLElement Objects
ja: NSXMLElementオブジェクトを初期化する

source: Initializing a Parser Object
ja: パーサーオブジェクトを初期化する

source: Initializing an NSXMLDTD Object
ja: NSXMLDTDオブジェクトを初期化する

source: Initializing an NSXMLDTDNode Object
ja: NSXMLDTDNodeオブジェクトを初期化する

source: Input and Events
ja: 入力とイベント

source: Input and Output Options
ja: 入出力オプション

source: Input and output options specifically intended for NSXMLDocument objects.
ja: とりわけNSXMLDocumentオブジェクトに対して意図される入力および出力オプション。

source: Inserts a child node in the receiver’s list of children at a specific location in the list.
ja: ある子ノードを、レシーバのもつ子それらのリストにおいて、そのリストの中のある指定された位置で挿入します。

source: Inserts a new child node at a specified location in the receiver’s list of child nodes.
ja: ある新しい子ノードを、ある指定された位置で、レシーバのもつ子ノードそれらからなるリストにおいて挿入します。

source: Inserts a node object at specified position in the receiver’s array of children.
ja: あるノードオブジェクトをレシーバのもつ子それらの配列の中の指定された位置で挿入します。

source: Inserts an array of child nodes at a specified location in the receiver’s list of children.
ja: 子ノードそれらからなるある配列を、ある指定された位置で、レシーバのもつ子それらのリストにおいて挿入します。

source: Inserts an array of children at a specified position in the receiver’s array of children.
ja: 子それらからなるある配列を、レシーバのもつ子それらの配列において、ある指定された位置で挿入します。

source: Inserts the elements of another set into this option set.
ja: 別のセットの要素をこのオプションセットへと挿入します。

source: Inserts the given element into the set.
ja: 与えられた要素をセットへと挿入します。

source: Inspecting Views
ja: ビューを検査する

source: Instance Method
ja: インスタンスメソッド

source: Instance Methods
ja: インスタンス メソッド

source: Instance Properties
ja: インスタンスプロパティ

source: Instance Property
ja: インスタンスプロパティ

source: Instead, a string literal triggers the init(_:tableName:bundle:comment:) method — which treats the input as a LocalizedStringKey instance — and attempts to perform localization.
ja: 代わりに、文字列リテラルはinit(_:tableName:bundle:comment:)メソッドの引き金となります — それはその入力をLocalizedStringKeyインスタンスとして扱います — そしてローカライゼーションを実行しようと試みます。

source: Instead, create a new set using an array literal as its value by enclosing a comma-separated list of values in square brackets.
ja: 代わりに、新しい集合を配列リテラルをそれの値として、コンマ区切りの値のリストを角カッコで囲むことによって、作成してください。

source: Instead, declare a property with the @ObservedObject attribute, and provide an initial value.
ja: 代わりに、あるプロパティを@ObservedObject属性で宣言してください、そして初期値を提供してください。

source: Instead, declare a property with the @State attribute, and provide an initial value; for example, @State private var isPlaying: Bool = false.
ja: 代わりに、あるプロパティを@State属性で宣言してください、そしてある初期値を提供してください；例えば、@State private var isPlaying: Bool = false。

source: Instead, the gesture state property automatically resets its state back to its initial value.
ja: 代わりに、ジェスチャ状態プロパティは、自動的にそれの状態をリセットしてそれの初期値に戻します。

source: Instead, they log a warning and display a placeholder image to highlight the error.
ja: その代わりに、それらは警告を記録します、そしてプレースホルダ画像を表示してそのエラーを目立たせます。

source: Instead, you use the property variable created with the @Binding attribute.
ja: 代わりに、あなたは@Binding属性で作成されたプロパティ変数を使います。

source: Instead, you use the property variable created with the @EnvironmentObject attribute.
ja: 代わりに、あなたは@EnvironmentObject属性で作成されたプロパティ変数を使います。

source: Instead, you use the property variable created with the @ObservedObject attribute.
ja: 代わりに、あなたは@ObservedObject属性で作成されたプロパティ変数を使います。

source: Instead, you use the property variable created with the @State attribute.
ja: 代わりに、あなたは@State属性で作成されたプロパティ変数を使います。

source: Integrate SwiftUI views into existing apps, and embed AppKit, UIKit, and WatchKit views and controllers into SwiftUI view hierarchies.
ja: SwiftUIビューを既存のアプリへと、そして埋め込みAppKit、UIKit、そしてWatchKitビューとコントローラをSwiftUIビュー階層へと統合しましょう。

source: Integrate SwiftUI with your app's existing content using:
ja: SwiftUIをあなたのアプリのもつ既存の内容と統合してください、以下を使って：

source: Interact with other parts of the system by invoking actions.
ja: システムの他の部分との相互作用を、アクションを発動することによって行ってください。

source: Interacting with the toggle control changes the value of the Bool, and mutating the value of the Bool causes the toggle to update its presented state.
ja: トグルコントロールとの相互作用は、Boolの値を変更します、そしてBoolの値の変異は、トグルにそれの提示される状態を更新させます。

source: Interfacing with UIKit
ja: UIKitと結びつける

source: Internationalization
ja: 国際化

source: Introducing SwiftUI
ja: SwiftUIを導入する

source: Invalidates the current SwiftUI views and triggers an update during the next cycle.
ja: 現在のSwiftUIビューを無効にします、そしてある更新を次の循環の間に引き起こします。

source: Inverts the colors in the view.
ja: ビューの中の色を反転します。

source: Inverts the colors in this view.
ja: このビューにおいて色を逆にします。

source: Invoked when the task is completed.
ja: タスクが完了された時に発動されます。

source: It also provides the light or dark options for any particular view when the app wants to override the user setting.
ja: それはまた、ライトまたはダークオプションを何らかの特定のビューに対して提供します、アプリがユーザ設定をオーバーライドしたい場合に。

source: It also reports parsing errors.
ja: それはまた、構文解析エラーを報告します。

source: It applies the opacity(_:) effect to the VStack before the blur(radius:) effect is applied to the views inside the enclosed ZStack.
ja: それは、opacity(_:)エフェクトをVStackに適用します、blur(radius:)エフェクトがZStackの内部に囲まれているビューそれらに適用される前に。

source: It can be configured to only display specific components of the date, but still results in picking a complete Date instance.
ja: それは日付の特定の構成要素を表示するだけのために構成設定されることができます、しかし依然として完全なDateインスタンスを選ぶという結果になります。

source: It does not itself do anything with those parsed items except report them.
ja: それはそれ自身では、それら構文解析した項目で何もしません、それらを報告することを除いて。

source: It has the same horizontal screen coordinate for all children.
ja: それは、同じ水平画面座標を全ての子に対して持ちます。

source: It has the same vertical screen coordinate for all children.
ja: それは、同じ垂直画面座標を全ての子に対して持ちます。

source: It is at the “root” of a shallow tree consisting primarily of nodes representing DTD declarations.
ja: それは、DTD宣言を表しているノードから主として成る浅いツリーの “ルート” にあります。

source: It is generally used for display lines set in large and small caps, such as titles.
ja: それは、一般的にラージおよびスモールキャップに設定される行を表示するために使われます、たとえばタイトルなど。

source: It is generally used for words which would otherwise be set in all caps, such as acronyms, but which are desired in small-cap form to avoid disrupting the flow of text.
ja: それは一般的にいくつかの単語に対して使われます、それらはたとえば頭文字略称などそうでなければオールキャップに設定される、しかしテキストの流れを混乱させるのを防ぐためにスモールキャップ形式で望まれるものです。

source: It is safe to mutate state properties from any thread.
ja: 状態プロパティをどのスレッドからであれ変化させるのは安全です。

source: It is used by the compiler when you use an array literal.
ja: それは、あなたが配列リテラルを使う時にコンパイラによって使われます。

source: It may also have attribute nodes and namespace nodes associated with it (however, namespace and attribute nodes are not considered children).
ja: それはまた、それと結びつけられる属性ノードと名前空間ノードを持つかもしれません（しかしながら、名前空間と属性ノードは子と見なされません）。

source: It may include forms related to small capitals, such as old-style figures.
ja: それは、スモールキャピタルに関連する形式を含むかもしれません、たとえばオールドスタイルフィギュアなど。

source: It places one circle at its default position.
ja: それは１つ目の円をそれの省略時の位置に置きます。

source: It then converts them back into the local coordinate system via a LayoutContext, such as in a layout’s situate(_:updating:in:) function.
ja: それは、それからそれらをローカル座標系へとLayoutContext経由で変換します、たとえばあるレイアウトのもつsituate(_:updating:in:)関数でなど。

source: Italic text.
ja: イタリックテキスト。

source: Its currentState parameter is the updated state of the gesture.
ja: それのcurrentStateパラメータは、ジェスチャの更新後の状態です。

source: Its value is a struct with two optional values, each representing the phases of one of the two gestures.
ja: それの値は、２つのオプショナル値をもつstructです、それぞれは２つのジェスチャの１つのうちの様相を表しています。

source: It’s important that the id of a data element doesn’t change unless you replace the data element with a new data element that has a new identity.
ja: 重要なことは、あるデータ要素のidは変化しないことです、あなたがそのデータ要素を新しい同一性を持つ新しいデータ要素と置き換えない限りは。

source: It’s important that the id of a data element doesn’t change, unless SwiftUI considers the data element to have been replaced with a new data element that has a new identity.
ja: 重要なことは、あるデータ要素のidは変化しないことです、SwiftUIがそのデータ要素を新しい同一性を持つ新しいデータ要素と置き換えられたと見なさない限りは。

source: It’s set to .optional but is configurable by the user:
ja: それは.optionalに設定されます、しかしユーザによって構成設定可能です：

source: Keeping a Widget Up To Date
ja: ウィジェットを最新の状態に保つ

source: Kerning attempts to maintain ligatures.
ja: カーニングは、リガチャを保守しようとします。

source: Kerning defines the offset, in points, that a text view should shift characters from the default spacing.
ja: カーニングは、オフセットをポイントで定義します、それはテキストビューが文字を省略時の空きから移動すべきものです。

source: Keyboard shortcuts describe combinations of keys on a keyboard that the user can press in order to activate a button or toggle.
ja: キーボードショートカットは、キーボード上のキーの組み合わせを記述します、それはユーザがボタンまたはトグルを作動するために押すことができます。

source: Keys
ja: キー

source: Launches the task represented by the receiver.
ja: レシーバによって表されるタスクを起動します。

source: Layering Views
ja: ビューを層にする

source: Layers a secondary view in front of the view.
ja: ２番目のビューをこのビューの前において層にして重ねます。

source: Layers the given view behind this view.
ja: 与えられたビューをこのビューの背後に層として重ねます。

source: Layout
ja: レイアウト

source: Learn to Make Apps with SwiftUI
ja: SwiftUIでのアプリ作成を学ぶ

source: Let nil-expressible values default-initialize to nil.
ja: nil表現可能値がnilに省略時初期化するのを許可します。

source: Likewise, onDecrement will be initialized to nil if attempting to decrement value will have no effect.
ja: 同様に、onDecrementはnilに初期化されるでしょう、もしvalueを漸減する試みが効果を持たないならば。

source: Likewise, if distance < 0, a limit that is greater than i has no effect.
ja: 同様に、distance < 0ならば、iより大きい限度は効果を持ちません。

source: Likewise, if distance < 0, limit should be less than i to have any effect.
ja: 同様に、もしdistance < 0ならば、limitは、何らかの効果を持つためにiより小さくあるべきです。

source: List Styles
ja: リスト様式

source: Lists and Scroll Views
ja: リストおよびスクロールビュー

source: Loads the specified interface controllers and rebuilds the app's page-based interface.
ja: 指定されたインターフェイスコントローラをロードします、そしてアプリのもつページ基盤インターフェイスを作り直します。

source: Localizing Strings
ja: 文字列をローカライズする

source: Low sensitivity.
ja: 低感度。

source: Lower end of the range reported.
ja: 報告される範囲の下側の終わり。

source: Make sure the controls contained in a context menu are related to the context from which you show them.
ja: あるコンテキストメニューの中に含まれるコントロールそれらが、それによってあなたがそれらを表示するところの文脈に関連しているのを確認してください。

source: Make your app accessible to everyone by applying accessibility modifiers to your SwiftUI views.
ja: あなたのアプリを誰もがアクセス可能なものにしてください、アクセスビリティ修飾子をあなたのSwiftUIビューに加えることによって。

source: Make your views accessible to a broad range of users, including people with disabilities.
ja: あなたのビューを広範囲のユーザにアクセス可能にします、身体障害をもつ人々を含めて。

source: Making a Configurable Widget
ja: 構成設定可能なウィジェットを作る

source: Managing Accessibility Behaviors
ja: アクセシビリティ挙動を管理する
